## Staging Plan for alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.s3_scan_object_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "s3_scan_object_error" {
      + id             = (known after apply)
      + log_group_name = "/var/lambda/s3-scan-object"
      + name           = "ErrorLoggedS3ScanObject"
      + pattern        = "ERROR"

      + metric_transformation {
          + name      = "ErrorLoggedS3ScanObject"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.scan_files_api_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "scan_files_api_error" {
      + id             = (known after apply)
      + log_group_name = "/var/lambda/scan-files-api"
      + name           = "ErrorLoggedAPI"
      + pattern        = "ERROR"

      + metric_transformation {
          + name      = "ErrorLoggedAPI"
          + namespace = "ScanFiles"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.s3_scan_object_error will be created
  + resource "aws_cloudwatch_metric_alarm" "s3_scan_object_error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + alarm_description                     = "Errors logged by the S3 scan object lambda function"
      + alarm_name                            = "ErrorLoggedS3ScanObject"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ErrorLoggedS3ScanObject"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.scan_files_api_error will be created
  + resource "aws_cloudwatch_metric_alarm" "scan_files_api_error" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + alarm_description                     = "Errors logged by the Scan Files API lambda function"
      + alarm_name                            = "ErrorLoggedAPI"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ErrorLoggedAPI"
      + namespace                             = "ScanFiles"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:127893201980:cloudwatch-alarms-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_health_check_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.s3_scan_object_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_api_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_warning_us_east"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_lambda_function.notify_slack"]

26 tests, 17 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
